
{
  "harmfulIngredients": {
      "aspartame": {
          "diseases": [
              "Aspartame can cause headaches and allergic reactions in some individuals. It's often considered safe in moderation",
              "but some studies suggest a potential link to health issues."
          ]
      },
      "sucralose": {
          "diseases": [
              "Sucralose is generally recognized as safe",
              "but some studies suggest it may alter gut bacteria and cause digestive issues."
          ]
      },
      "saccharin": {
          "diseases": [
              "Saccharin has been linked to bladder cancer in laboratory animals",
              "but extensive studies show it is safe for human consumption in moderation."
          ]
      },
      "stevia": {
          "diseases": [
              "Stevia is a natural sweetener and may have health benefits",
              "including lowering blood sugar levels and having antioxidant properties."
          ]
      },
      "benzoate": {
          "diseases": [
              "Benzoates can cause allergic reactions in some individuals and have been associated with hyperactivity in children."
          ]
      },
      "sorbate": {
          "diseases": [
              "Sorbates are generally safe but can cause allergic reactions in some people."
          ]
      },
      "preservative": {
          "diseases": [
              "Some preservatives may cause allergic reactions or sensitivities",
              "while others are considered safe."
          ]
      },
      "sugar": {
          "diseases": [
              "Excessive sugar consumption can lead to obesity",
              "diabetes",
              "and heart disease."
          ]
      },
      "salt": {
          "diseases": [
              "High salt intake can lead to hypertension and increase the risk of heart disease."
          ]
      },
      "water": {
          "diseases": [
              "Water is essential for life",
              "but excessive consumption can lead to water intoxication."
          ]
      },
      "wheat": {
          "diseases": [
              "Wheat can trigger gluten sensitivities or celiac disease in some individuals."
          ]
      },
      "milk": {
          "diseases": [
              "Milk is a good source of calcium and vitamin D but can cause lactose intolerance in some people."
          ]
      },
      "dextrose": {
          "diseases": [
              "Dextrose is a simple sugar that can spike blood sugar levels if consumed in excess."
          ]
      },
      "glucose": {
          "diseases": [
              "Glucose is a primary energy source",
              "but excessive intake can lead to health issues like obesity and diabetes."
          ]
      },
      "fructose": {
          "diseases": [
              "Fructose can lead to insulin resistance and fatty liver disease when consumed in large amounts."
          ]
      },
      "maltodextrin": {
          "diseases": [
              "Maltodextrin can spike blood sugar levels and should be consumed in moderation by those with diabetes."
          ]
      },
      "gelatin": {
          "diseases": [
              "Gelatin is safe for most but can cause allergic reactions in some."
          ]
      },
      "emulsifier": {
          "diseases": [
              "Emulsifiers are generally safe but can cause digestive issues in sensitive individuals."
          ]
      },
      "antioxidants": {
          "diseases": [
              "Antioxidants are beneficial for health",
              "reducing oxidative stress and inflammation."
          ]
      },
      "sorbitol": {
          "diseases": [
              "Sorbitol can cause digestive issues in large amounts but is used as a low-calorie sweetener."
          ]
      },
      "glycerin": {
          "diseases": [
              "Glycerin is generally safe but can cause gastrointestinal distress in high amounts."
          ]
      },
      "pectin": {
          "diseases": [
              "Pectin is safe and may have health benefits",
              "including lowering cholesterol levels."
          ]
      },
      "dextrin": {
          "diseases": [
              "Dextrin can spike blood sugar levels and should be consumed in moderation."
          ]
      },
      "monoglycerides": {
          "diseases": [
              "Monoglycerides are generally safe and used as emulsifiers."
          ]
      },
      "diglycerides": {
          "diseases": [
              "Diglycerides are generally safe and used as emulsifiers."
          ]
      },
      "enzymes": {
          "diseases": [
              "Enzymes are beneficial for digestion and various bodily functions."
          ]
      }
  }
}
